# Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.

str1 = input('Введите строку 1: ')
str2 = input('Введите строку 2: ')
count = str1.count(str2)
print(count)
