# Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
# Примеры:
# 6,78 -> 7
# 5 -> нет
# 0,34 -> 3

a = float(input('Введите дробное число a '))
a = str(a % 1)
print(a[2])

# ================================================

# a = float(input("Введите число "))
# b = int(a * 10)
# result = b % 10
# if result == 0:
#     print('Нет')
# else:
#     print(result)

# ================================================

# a = float(input("Введите 1 число "))
# result = int((a * 10) % 10)
# print(result)
